{"A": {"avgVolume": 1351606, "description": "Agilent Technologies, Inc. provides application focused solutions to the life sciences, diagnostics, and applied chemical markets worldwide. The Life Sciences and Applied Markets segment offers liquid chromatography systems and components; liquid chromato", "industry": "Diagnostics & Research", "marketCap": 44183000000000, "sector": "Healthcare"}, "AA": {"avgVolume": 6841890, "description": "Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through three segments: Bauxit", "industry": "Aluminum", "marketCap": 7821000000000, "sector": "Basic Materials"}, "AAC": {"avgVolume": 587674, "description": "Ares Acquisition Corporation does not have significant operations. It intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. The company was incorporated ", "industry": "Shell Companies", "marketCap": 1259000000000, "sector": "Financial Services"}, "AACG": {"avgVolume": 8173, "description": "ATA Creativity Global, together with its subsidiaries, provides educational services to individual students through its training center network in China and internationally. Its educational services include portfolio training, research-based learning, ove", "industry": "Education & Training Services", "marketCap": 45183000000, "sector": "Consumer Defensive"}, "AACI": {"avgVolume": 8271, "description": "Armada Acquisition Corp. I focuses on effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or related business combination with one or more businesses. It intends to focus on target businesses that provide technol", "industry": "Shell Companies", "marketCap": 208338000000, "sector": "Financial Services"}, "AADI": {"avgVolume": 87726, "description": "Aadi Bioscience, Inc., a clinical-stage biopharmaceutical company, engages in developing and commercializing precision therapies for genetically defined cancers with alterations in mTOR pathway genes. Its lead drug candidate, FYARRO is a form of sirolimus", "industry": "Biotechnology", "marketCap": 305427000000, "sector": "Healthcare"}, "AAIC": {"avgVolume": 71860, "description": "Arlington Asset Investment Corp. (NYSE: AAIC) currently invests primarily in mortgage related and residential real estate and has elected to be taxed as a REIT. The Company is headquartered in the Washington, D.C. metropolitan area. For more information, ", "industry": "REIT-Mortgage", "marketCap": 81412000000, "sector": "Real Estate"}, "AAIN": {"avgVolume": 2406, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "AAL": {"avgVolume": 30436158, "description": "American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas/Fort Worth, Los Angeles, Miami, N", "industry": "Airlines", "marketCap": 826000000000, "sector": "Industrials"}, "AAMC": {"avgVolume": 3711, "description": "Altisource Asset Management Corporation is an alternative lending company that provides liquidity and capital to under-served market and portfolio management and corporate governance services to institutional investors in the United States. The company of", "industry": "Asset Management", "marketCap": 34833000000, "sector": "Financial Services"}, "AAME": {"avgVolume": 3201, "description": "Atlantic American Corporation, through its subsidiaries, provides life and health, and property and casualty insurance products in the United States. The company operates through American Southern and Bankers Fidelity segments. It offers property and casu", "industry": "Insurance-Life", "marketCap": 49289000000, "sector": "Financial Services"}, "AAN": {"avgVolume": 477041, "description": "The Aaron's Company, Inc. provides lease-to-own and purchase solutions. The company engages in direct-to-consumer sales and lease ownership of furniture, appliances, electronics, computers, and accessories through company-operated and franchised stores in", "industry": "Rental & Leasing Services", "marketCap": 349974000000, "sector": "Industrials"}, "AAOI": {"avgVolume": 210463, "description": "Applied Optoelectronics, Inc. designs, manufactures, and sells various fiber-optic networking products worldwide. It offers optical modules, lasers, subassemblies, transmitters and transceivers, and turn-key equipment, as well as headend, node, and distri", "industry": "Semiconductors", "marketCap": 55621000000, "sector": "Technology"}, "AAON": {"avgVolume": 185276, "description": "AAON, Inc., together with its subsidiaries, engages in engineering, manufacturing, marketing, and selling air conditioning and heating equipment in the United States and Canada. The company operates through three segments: AAON Oklahoma, AAON Coil Product", "industry": "Building Products & Equipment", "marketCap": 4036000000000, "sector": "Industrials"}, "AAP": {"avgVolume": 1008385, "description": "Advance Auto Parts, Inc. provides automotive replacement parts, accessories, batteries, and maintenance items for domestic and imported cars, vans, sport utility vehicles, and light and heavy duty trucks. The company offers battery accessories; belts and ", "industry": "Specialty Retail", "marketCap": 849000000000, "sector": "Consumer Cyclical"}, "AAPL": {"avgVolume": 86434942, "description": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. It also sells various related services. In addition, the company offers iPhone, a line of smartphones; Mac, a line of personal co", "industry": "Consumer Electronics", "marketCap": 2098000000000000, "sector": "Technology"}, "AAQC": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "AAT": {"avgVolume": 340868, "description": "American Assets Trust, Inc. is a full service, vertically integrated and self-administered real estate investment trust, or REIT, headquartered in San Diego, California. The company has over 50 years of experience in acquiring, improving, developing and m", "industry": "REIT-Diversified", "marketCap": 2035000000000, "sector": "Real Estate"}, "AATC": {"avgVolume": 18928, "description": "Autoscope Technologies Corporation develops and markets video and radar processing products for use in intersection control, highway, bridge and tunnel traffic management, and traffic data collection applications in the Asia Pacific, Europe, the Middle Ea", "industry": "Scientific & Technical Instruments", "marketCap": 20549000000, "sector": "Technology"}, "AAU": {"avgVolume": 338846, "description": "Almaden Minerals Ltd., an exploration stage company, engages in the acquisition, exploration, evaluation, and development of mineral properties. It primarily owns a 100% interest in the Ixtaca gold-silver project located in Puebla State, Mexico. The compa", "industry": "Gold", "marketCap": 34195000000, "sector": "Basic Materials"}, "AAWW": {"avgVolume": 479258, "description": "Atlas Air Worldwide Holdings, Inc., through its subsidiaries, provides outsourced aircraft and aviation operating services. It operates through two segments, Airline Operations and Dry Leasing. The company offers outsourced cargo and passenger aircraft op", "industry": "Airports & Air Services", "marketCap": 2856000000000, "sector": "Industrials"}, "AB": {"avgVolume": 371704, "description": "AllianceBernstein Holding L.P. is publicly owned investment manager. The firm also provides research services to its clients. It provides its services to investment companies, pension and profit sharing plans, banks and thrift institutions, trusts, estate", "industry": "Asset Management", "marketCap": 3422000000000, "sector": "Financial Services"}, "ABB": {"avgVolume": 1586743, "description": "ABB Ltd engages in manufacture and sale of electrification, automation, robotics, and motion products for customers in utilities, industry and transport, and infrastructure in Switzerland and internationally. Its Electrification segment provides electric ", "industry": "Electrical Equipment & Parts", "marketCap": 57186000000000, "sector": "Industrials"}, "ABBV": {"avgVolume": 5557837, "description": "AbbVie Inc. discovers, develops, manufactures, and sells pharmaceuticals in the worldwide. The company offers HUMIRA, a therapy administered as an injection for autoimmune and intestinal Behçet's diseases; SKYRIZI to treat moderate to severe plaque psoria", "industry": "Drug Manufacturers-General", "marketCap": 288245000000000, "sector": "Healthcare"}, "ABC": {"avgVolume": 1517670, "description": "AmerisourceBergen Corporation sources and distributes pharmaceutical products. Its U.S. Healthcare Solutions segment distributes brand-name and generic pharmaceuticals, over-the-counter healthcare products, home healthcare supplies and equipment, and rela", "industry": "Medical Distribution", "marketCap": 34151000000000, "sector": "Healthcare"}, "ABCB": {"avgVolume": 349822, "description": "Ameris Bancorp operates as the bank holding company for Ameris Bank that provides range of banking services to retail and commercial customers primarily in Georgia, Alabama, Florida, North Carolina, and South Carolina. The company operates through five se", "industry": "Banks-Regional", "marketCap": 3326000000000, "sector": "Financial Services"}, "ABCL": {"avgVolume": 2022437, "description": "AbCellera Biologics Inc. develops antibody discovery platform. Its full-stack, artificial intelligence-powered antibody discovery platform searches and analyzes the database of natural immune systems to find antibodies that could be developed as drugs. As", "industry": "Biotechnology", "marketCap": 2712000000000, "sector": "Healthcare"}, "ABCM": {"avgVolume": 525222, "description": "Abcam plc, a life science company, focuses on identifying, developing, and distributing reagents and tools for scientific research, diagnostics, and drug discovery. Its principal products include primary and secondary antibodies; conjugated antibodies and", "industry": "Biotechnology", "marketCap": 362000000000, "sector": "Healthcare"}, "ABEO": {"avgVolume": 544638, "description": "Abeona Therapeutics Inc., a clinical-stage biopharmaceutical company, develops gene and cell therapies for life-threatening rare genetic diseases. Its lead program is EB-101, an autologous, gene-corrected cell therapy that is in Phase III clinical trial f", "industry": "Biotechnology", "marketCap": 41394000000, "sector": "Healthcare"}, "ABEV": {"avgVolume": 29975433, "description": "Ambev S.A., through its subsidiaries, produces, distributes, and sells beer, draft beer, carbonated soft drinks, other non-alcoholic beverages, malt, and food products. The company operates through four segments: Brazil; Central America and the Caribbean;", "industry": "Beverages-Brewers", "marketCap": 43101000000000, "sector": "Consumer Defensive"}, "ABG": {"avgVolume": 200575, "description": "Asbury Automotive Group, Inc., together with its subsidiaries, operates as an automotive retailer in the United States. It offers a range of automotive products and services, including new and used vehicles; and vehicle repair and maintenance services, re", "industry": "Auto & Truck Dealerships", "marketCap": 3818000000000, "sector": "Consumer Cyclical"}, "ABGI": {"avgVolume": 45125, "description": "ABG Acquisition Corp. I does not have significant operations. It focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. ABG Acquisition Corp. I was inc", "industry": "Shell Companies", "marketCap": 194679000000, "sector": "Financial Services"}, "ABIO": {"avgVolume": 28235, "description": "ARCA biopharma, Inc., a clinical-stage biopharmaceutical company, develops and commercializes genetically targeted therapies for cardiovascular diseases. Its lead product candidates are Recombinant Nematode Anticoagulant Protein c2 (rNAPc2) (AB201), which", "industry": "Biotechnology", "marketCap": 32999000000, "sector": "Healthcare"}, "ABM": {"avgVolume": 322066, "description": "ABM Industries Incorporated, through its subsidiaries, engages in the provision of integrated facility, infrastructure, and mobility solutions in the United States and internationally. The company operates through Business & Industry, Manufacturing & Dist", "industry": "Specialty Business Services", "marketCap": 2925000000000, "sector": "Industrials"}, "ABMD": {"avgVolume": 1482732, "description": "Abiomed, Inc. engages in the research, development, and sale of medical devices to assist or replace the pumping function of the failing heart. It also provides a continuum of care to heart failure patients. The company offers Impella 2.5, a percutaneous ", "industry": "Medical Devices", "marketCap": 17181000000000, "sector": "Healthcare"}, "ABNB": {"avgVolume": 6138025, "description": "Airbnb, Inc., together with its subsidiaries, operates a platform that enables hosts to offer stays and experiences to guests worldwide. The company's marketplace model connects hosts and guests online or through mobile devices to book spaces and experien", "industry": "Travel Services", "marketCap": 52864000000000, "sector": "Consumer Cyclical"}, "ABOS": {"avgVolume": 1451609, "description": "Acumen Pharmaceuticals, Inc., a clinical-stage biopharmaceutical company, discovers and develops therapies for the treatment of Alzheimer's disease. The company focuses on advancing a targeted immunotherapy drug candidate ACU193, a humanized monoclonal an", "industry": "Biotechnology", "marketCap": 207491000000, "sector": "Healthcare"}, "ABP": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "ABR": {"avgVolume": 2101525, "description": "Arbor Realty Trust, Inc. invests in a diversified portfolio of structured finance assets in the multifamily, single-family rental, and commercial real estate markets in the United States. The company operates in two segments, Structured Business and Agenc", "industry": "REIT-Mortgage", "marketCap": 2331000000000, "sector": "Real Estate"}, "ABSI": {"avgVolume": 309424, "description": "Absci Corporation, a drug and target discovery company, provides biologic drug candidates and production cell lines using integrated drug creation platform for partners in the United States. Its integrated drug creation platform enables the creation of bi", "industry": "Biotechnology", "marketCap": 18479000000, "sector": "Healthcare"}, "ABST": {"avgVolume": 113046, "description": "Absolute Software Corporation develops, markets, and provides software services that support the management and security of computing devices, applications, data, and networks for various organizations. The company's Absolute platform offer Absolute Visib", "industry": "Software-Application", "marketCap": 505224000000, "sector": "Technology"}, "ABT": {"avgVolume": 5839506, "description": "Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Dev", "industry": "Medical Devices", "marketCap": 189299000000000, "sector": "Healthcare"}, "ABUS": {"avgVolume": 949516, "description": "Arbutus Biopharma Corporation, a biopharmaceutical company, develops novel therapeutics for chronic Hepatitis B virus (HBV) infection, SARS-CoV-2, and other coronaviruses in the United States. Its HBV product pipeline consists of AB-729, a proprietary sub", "industry": "Biotechnology", "marketCap": 364568000000, "sector": "Healthcare"}, "ABVC": {"avgVolume": 16425, "description": "ABVC BioPharma, Inc., a clinical stage biopharmaceutical company, develops drugs and medical devices to fulfill unmet medical needs in the United States. The company is developing ABV-1501, which is in Phase I/II clinical trials a combination therapy for ", "industry": "Biotechnology", "marketCap": 21211000000, "sector": "Healthcare"}, "AC": {"avgVolume": 3496, "description": "Associated Capital Group, Inc. provides investment advisory services in the United States. The company offers alternative investment management and asset management services. It also invests in new and existing businesses. The company was founded in 1976 ", "industry": "Capital Markets", "marketCap": 891529000000, "sector": "Financial Services"}, "ACA": {"avgVolume": 229337, "description": "Arcosa, Inc., together with its subsidiaries, provides infrastructure-related products and solutions for the construction, energy, and transportation markets in North America. It operates through three segments: Construction Products, Engineered Structure", "industry": "Infrastructure Operations", "marketCap": 2678000000000, "sector": "Industrials"}, "ACAB": {"avgVolume": 19391, "description": "Atlantic Coastal Acquisition Corp. II does not have significant operations. It focuses on effecting a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization, or similar business combination with one or more businesses ", "industry": "Shell Companies", "marketCap": 38175000000, "sector": "Financial Services"}, "ACAD": {"avgVolume": 1311469, "description": "ACADIA Pharmaceuticals Inc., a biopharmaceutical company, focuses on the development and commercialization of small molecule drugs that address unmet medical needs in central nervous system disorders. The company offers NUPLAZID (pimavanserin) for the tre", "industry": "Biotechnology", "marketCap": 2478000000000, "sector": "Healthcare"}, "ACAH": {"avgVolume": 51916, "description": "Atlantic Coastal Acquisition Corp. does not have significant operations. It intends to effect a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses in mobility sect", "industry": "Shell Companies", "marketCap": 431681000000, "sector": "Financial Services"}, "ACAQ": {"avgVolume": 70904, "description": "Athena Consumer Acquisition Corp. does not have significant operations. It focuses on effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or related business combination with one or more businesses. The company i", "industry": "Shell Companies", "marketCap": 336352000000, "sector": "Financial Services"}, "ACAX": {"avgVolume": 4941, "description": "Alset Capital Acquisition Corp. focuses on effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses. It intends to focus on identifying businesses in the rea", "industry": "Shell Companies", "marketCap": 112775000000, "sector": "Financial Services"}, "ACB": {"avgVolume": 13158985, "description": "Aurora Cannabis Inc., together with its subsidiaries, produces, distributes, and sells cannabis and cannabis-derivative products in Canada and internationally. The company produces, distributes, and sells medical and consumer cannabis products in Canada. ", "industry": "Drug Manufacturers-Specialty & Generic", "marketCap": 279413000000, "sector": "Healthcare"}, "ACBA": {"avgVolume": 8204, "description": "Ace Global Business Acquisition Limited does not have significant operations. The company intends to effect a merger, share exchange, asset acquisition, share purchase, recapitalization, reorganization, or similar business combination with one or more bus", "industry": "Shell Companies", "marketCap": 64475000000, "sector": "Financial Services"}, "ACBI": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "ACCD": {"avgVolume": 651188, "description": "Accolade, Inc., together with its subsidiaries, develops and provides technology-enabled solutions that help people to understand, navigate, and utilize the healthcare system and their workplace benefits in the United States. The company offers a platform", "industry": "Health Information Services", "marketCap": 517241000000, "sector": "Healthcare"}, "ACCO": {"avgVolume": 746932, "description": "ACCO Brands Corporation designs, manufactures, and markets consumer, school, technology, and office products. It operates through three segments: ACCO Brands North America, ACCO Brands EMEA, and ACCO Brands International. The company provides computer and", "industry": "Business Equipment & Supplies", "marketCap": 529746000000, "sector": "Industrials"}, "ACDC": {"avgVolume": 404580, "description": "ProFrac Holding Corp., a vertically integrated and energy services company, provides hydraulic fracturing, completion, and other products and services to upstream oil and gas companies engaged in the exploration and production of North American unconventi", "industry": "Oil & Gas Equipment & Services", "marketCap": 135000000000, "sector": "Energy"}, "ACDI": {"avgVolume": 36911, "description": "Ascendant Digital Acquisition Corp. III does not have significant operations. It intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses in the interactive ", "industry": "Shell Companies", "marketCap": 38625000000, "sector": "Financial Services"}, "ACEL": {"avgVolume": 246152, "description": "Accel Entertainment, Inc., together with its subsidiaries, operates as a distributed gaming operator in the United States. It is involved in the installation, maintenance, and operation of gaming terminals; redemption devices that disburse winnings and co", "industry": "Gambling", "marketCap": 658627000000, "sector": "Consumer Cyclical"}, "ACER": {"avgVolume": 378986, "description": "Acer Therapeutics Inc., a pharmaceutical company, focuses on the acquisition, development, and commercialization of therapies for serious rare and life-threatening diseases. Its pipeline includes four clinical-stage candidates comprising EDSIVO for the tr", "industry": "Biotechnology", "marketCap": 4839000000, "sector": "Healthcare"}, "ACET": {"avgVolume": 745772, "description": "Adicet Bio, Inc., a biotechnology company, discovers and develops allogeneic gamma delta T cell therapies for cancer and other diseases. The company offers gamma delta T cells engineered with chimeric antigen receptors and T cell receptor-like antibodies ", "industry": "Biotechnology", "marketCap": 330812000000, "sector": "Healthcare"}, "ACEV": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "ACGL": {"avgVolume": 4036865, "description": "Arch Capital Group Ltd., together with its subsidiaries, provides insurance, reinsurance, and mortgage insurance products worldwide. The company's Insurance segment offers primary and excess casualty coverages; loss sensitive primary casualty insurance pr", "industry": "Insurance-Diversified", "marketCap": 23531000000000, "sector": "Financial Services"}, "ACHC": {"avgVolume": 649586, "description": "Acadia Healthcare Company, Inc. provides behavioral healthcare services in the United States and Puerto Rico. The company offers behavioral healthcare services to its patients in various settings, including inpatient psychiatric hospitals, specialty treat", "industry": "Medical Care Facilities", "marketCap": 7513000000000, "sector": "Healthcare"}, "ACHL": {"avgVolume": 160316, "description": "Achilles Therapeutics Plc, a clinical stage immuno-oncology biopharmaceutical company, develops precision T cell therapies to treat various solid tumors. The company's lead product candidates include CHIRON, which is in Phase I/IIa clinical trial for use ", "industry": "Biotechnology", "marketCap": 32751000000, "sector": "Healthcare"}, "ACHR": {"avgVolume": 1312047, "description": "Archer Aviation Inc., an urban air mobility company, engages in designs, develops, manufactures, and operates electric vertical takeoff and landing aircrafts to carry passengers. The company was formerly known as Atlas Crest Investment Corp. and changed i", "industry": "Aerospace & Defense", "marketCap": 396571000000, "sector": "Industrials"}, "ACHV": {"avgVolume": 66519, "description": "Achieve Life Sciences, Inc., a clinical-stage pharmaceutical company, develops and commercializes of cytisinicline for smoking cessation and nicotine addiction in Canada, the United States, and the United Kingdom. The company offers cytisinicline, a plant", "industry": "Biotechnology", "marketCap": 43311000000, "sector": "Healthcare"}, "ACI": {"avgVolume": 5070859, "description": "Albertsons Companies, Inc., through its subsidiaries, engages in the operation of food and drug stores in the United States. The company's food and drug retail stores offer grocery products, general merchandise, health and beauty care products, pharmacy, ", "industry": "Grocery Stores", "marketCap": 11295000000000, "sector": "Consumer Defensive"}, "ACII": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "ACIU": {"avgVolume": 123970, "description": "AC Immune SA, a clinical stage biopharmaceutical company, discovers, designs, and develops medicines and diagnostic products for the prevention and treatment of neurodegenerative diseases associated with protein misfolding. Its SupraAntigen and Morphomer ", "industry": "Biotechnology", "marketCap": 14514000000, "sector": "Healthcare"}, "ACIW": {"avgVolume": 976380, "description": "ACI Worldwide, Inc., a software company, develops, markets, installs, and supports a range of software products and solutions for facilitating digital payments to banks, merchants, and billers worldwide. The company offers ACI Acquiring, a merchant manage", "industry": "Software-Infrastructure", "marketCap": 2501000000000, "sector": "Technology"}, "ACLS": {"avgVolume": 397203, "description": "Axcelis Technologies, Inc. designs, manufactures, and services ion implantation and other processing equipment used in the fabrication of semiconductor chips in the United States, Europe, and Asia. The company offers high energy, high current, and medium ", "industry": "Semiconductor Equipment & Materials", "marketCap": 2602000000000, "sector": "Technology"}, "ACLX": {"avgVolume": 608760, "description": "Arcellx, Inc., a clinical-stage biotechnology company, engages in the development of various immunotherapies for patients with cancer and other incurable diseases. The company's lead ddCAR product candidate is CART-ddBCMA, which is in phase 1 clinical tri", "industry": "Biotechnology", "marketCap": 1299000000000, "sector": "Healthcare"}, "ACM": {"avgVolume": 698573, "description": "AECOM, together with its subsidiaries, provides professional infrastructure consulting services worldwide. It operates in three segments: Americas, International, and AECOM Capital. The company offers planning, consulting, architectural and engineering de", "industry": "Engineering & Construction", "marketCap": 11874000000000, "sector": "Industrials"}, "ACMR": {"avgVolume": 1026831, "description": "ACM Research, Inc., together with its subsidiaries, develops, manufactures, and sells single-wafer wet cleaning equipment for enhancing the manufacturing process and yield for integrated chips worldwide. It offers space alternated phase shift technology f", "industry": "Semiconductor Equipment & Materials", "marketCap": 428114000000, "sector": "Technology"}, "ACN": {"avgVolume": 2242963, "description": "Accenture plc, a professional services company, provides strategy and consulting, interactive, industry X, song, and technology and operation services worldwide. The company offers application services, including agile transformation, DevOps, application ", "industry": "Information Technology Services", "marketCap": 167211000000000, "sector": "Technology"}, "ACNB": {"avgVolume": 13583, "description": "ACNB Corporation, a financial holding company, provides banking, insurance, and financial services to individual, business, and government customers in the United States. The company offers checking, savings, and money market deposit accounts, as well as ", "industry": "Banks-Regional", "marketCap": 343481000000, "sector": "Financial Services"}, "ACNT": {"avgVolume": 25367, "description": "Ascent Industries Co. an industrials company, focuses on the production and distribution of industrial tubular products and specialty chemicals in the United States and internationally. It manufactures welded pipes and tubes, primarily from stainless stee", "industry": "Steel", "marketCap": 86515000000, "sector": "Basic Materials"}, "ACON": {"avgVolume": 45747, "description": "Aclarion, Inc., a healthcare technology company, develops software application for magnetic resonance spectroscopy (MRS) in the United States. It offers NOCISCAN-LS Post-Processor suite comprising NOCICALC-LS that receives and processes the acquired disc ", "industry": "Health Information Services", "marketCap": 3051000000, "sector": "Healthcare"}, "ACOR": {"avgVolume": 4031627, "description": "Acorda Therapeutics, Inc., a biopharmaceutical company, develops and commercializes therapies for neurological disorders in the United States. The company markets Ampyra (dalfampridine), an oral drug to improve walking in patients with multiple sclerosis ", "industry": "Drug Manufacturers-Specialty & Generic", "marketCap": 1508000000, "sector": "Healthcare"}, "ACQR": {"avgVolume": 157126, "description": "Independence Holdings Corp. does not have significant operations. It intends to effect a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or related business combination with one or more businesses or entities. The compan", "industry": "Shell Companies", "marketCap": 624225000000, "sector": "Financial Services"}, "ACR": {"avgVolume": 13101, "description": "ACRES Commercial Realty Corp., a real estate investment trust (REIT), focuses on the origination, holding, and management of commercial real estate mortgage loans and other commercial real estate-related debt investments in the United States. It invests i", "industry": "REIT-Mortgage", "marketCap": 69718000000, "sector": "Real Estate"}, "ACRE": {"avgVolume": 671045, "description": "Ares Commercial Real Estate Corporation, a specialty finance company, originates and invests in commercial real estate (CRE) loans and related investments in the United States. The company provides a range of financing solutions for the owners, operators,", "industry": "REIT-Mortgage", "marketCap": 598869000000, "sector": "Real Estate"}, "ACRO": {"avgVolume": 90449, "description": "Acropolis Infrastructure Acquisition Corp. does not have significant operations. It intends to effect a merger, consolidation, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more busi", "industry": "Shell Companies", "marketCap": 426506000000, "sector": "Financial Services"}, "ACRS": {"avgVolume": 340678, "description": "Aclaris Therapeutics, Inc. operates a clinical-stage biopharmaceutical company, develops novel drug candidates for immune-inflammatory diseases in the United States. It operates through two segments: Therapeutics and Contract Research. The Therapeutics se", "industry": "Diagnostics & Research", "marketCap": 1002000000000, "sector": "Healthcare"}, "ACRV": {"avgVolume": 67889, "description": "Acrivon Therapeutics, Inc., a clinical stage biopharmaceutical company, engages in developing precision oncology medicines that it matches to patients whose tumors are predicted to be sensitive to specific medicine by utilizing its proteomics-based patien", "industry": "Biotechnology", "marketCap": 240176000000, "sector": "Healthcare"}, "ACRX": {"avgVolume": 136854, "description": "AcelRx Pharmaceuticals, Inc., a specialty pharmaceutical company, focuses on the development and commercialization of therapies for the treatment of acute pain. Its lead product candidate is DSUVIA and DZUVEO, a 30 mcg sufentanil sublingual tablet for the", "industry": "Drug Manufacturers-Specialty & Generic", "marketCap": 14899000000, "sector": "Healthcare"}, "ACST": {"avgVolume": 139642, "description": "Acasti Pharma Inc., a biopharmaceutical company, engages in the development and commercialization of pharmaceutical products for cardiovascular diseases. It is evaluating strategic partnerships for the clinical development of CaPre. The company was incorp", "industry": "Biotechnology", "marketCap": 21285000000, "sector": "Healthcare"}, "ACTG": {"avgVolume": 300088, "description": "Acacia Research Corporation, together with its subsidiaries, invests in intellectual property and related absolute return assets; and engages in the licensing and enforcement of patented technologies. The company operates through two segments, Intellectua", "industry": "Specialty Business Services", "marketCap": 178733000000, "sector": "Industrials"}, "ACU": {"avgVolume": 8339, "description": "Acme United Corporation supplies first aid and safety, cutting, sharpening, and measuring products to the school, home, office, hardware, sporting goods, and industrial markets in the United States, Canada, Europe, and internationally. The company offers ", "industry": "Household & Personal Products", "marketCap": 78881000000, "sector": "Consumer Defensive"}, "ACVA": {"avgVolume": 1236080, "description": "ACV Auctions Inc. operates a digital marketplace that connects buyers and sellers for the online auction of wholesale vehicles. It also provides data services that offer insights into the condition and value of used vehicles, as well as offers customer fi", "industry": "Auto & Truck Dealerships", "marketCap": 1204000000000, "sector": "Consumer Cyclical"}, "ACXP": {"avgVolume": 20260, "description": "Acurx Pharmaceuticals, Inc., a clinical stage biopharmaceutical company, develops antibiotics to treat bacterial infections. Its lead antibiotic candidate is ibezapolstat, a novel mechanism of action that targets the polymerase IIIC enzyme that has comple", "industry": "Biotechnology", "marketCap": 48341000000, "sector": "Healthcare"}, "ADAG": {"avgVolume": 70803, "description": "Adagene Inc., a clinical stage biopharmaceutical company, engages in the research, development, and production of monoclonal antibody drugs for cancers. The company's product candidates include ADG106, a human ligand-blocking agonistic anti-CD137 monoclon", "industry": "Biotechnology", "marketCap": 50371000000, "sector": "Healthcare"}, "ADAL": {"avgVolume": 44062, "description": "Anthemis Digital Acquisitions I Corp does not have significant operations. It focuses on effecting a merger, amalgamation, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses or en", "industry": "Shell Companies", "marketCap": 30912000000, "sector": "Financial Services"}, "ADAP": {"avgVolume": 512393, "description": "Adaptimmune Therapeutics plc, a clinical-stage biopharmaceutical company, focuses on providing novel cell therapies primarily to patients with solid tumors in the United States and the United Kingdom. The company's specific peptide enhanced affinity recep", "industry": "Biotechnology", "marketCap": 216254000000, "sector": "Healthcare"}, "ADBE": {"avgVolume": 3629108, "description": "Adobe Inc. operates as a diversified software company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products, services, and solutions that enable individu", "industry": "Software-Infrastructure", "marketCap": 155783000000000, "sector": "Technology"}, "ADC": {"avgVolume": 907939, "description": "Agree Realty Corporation is a publicly traded real estate investment trust primarily engaged in the acquisition and development of properties net leased to industry-leading retail tenants. As of September 30, 2020, the Company owned and operated a portfol", "industry": "REIT-Retail", "marketCap": 6331000000000, "sector": "Real Estate"}, "ADCT": {"avgVolume": 712524, "description": "ADC Therapeutics SA, a commercial-stage biotechnology company, develops antibody drug conjugates (ADC) for patients suffering from hematological malignancies and solid tumors. Its flagship product ZYNLONTA that is in Phase II clinical trial for the treatm", "industry": "Biotechnology", "marketCap": 257782000000, "sector": "Healthcare"}, "ADD": {"avgVolume": 758972, "description": "Color Star Technology Co., Ltd., an entertainment and education company, provides online entertainment performances and music education services in the United States and China. The company operates Color World, an online platform of curriculum that includ", "industry": "Entertainment", "marketCap": 5453000000, "sector": "Communication Services"}, "ADEA": {"avgVolume": 843111, "description": "Adeia Inc., together with its subsidiaries, operates as a consumer and entertainment product/solutions licensing company worldwide. It licenses its innovations to companies in the entertainment industry under the Adeia brand. The company licenses its pate", "industry": "Software-Application", "marketCap": 99701000000, "sector": "Technology"}, "ADES": {"avgVolume": 64821, "description": "Advanced Emissions Solutions, Inc., together with its subsidiaries, provides environmental technologies and specialty chemicals in the United States. It operates through two segments, Refined Coal and Advanced Purification Technologies. The company offers", "industry": "Pollution & Treatment Controls", "marketCap": 42426000000, "sector": "Industrials"}, "ADEX": {"avgVolume": 121473, "description": "Adit EdTech Acquisition Corp. does not have significant operations. It focuses on effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses or entities. The c", "industry": "Shell Companies", "marketCap": 34914000000, "sector": "Financial Services"}, "ADGI": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "ADI": {"avgVolume": 3726211, "description": "Analog Devices, Inc. designs, manufactures, tests, and markets integrated circuits (ICs), software, and subsystems that leverage analog, mixed-signal, and digital signal processing technologies. The company provides data converter products, which translat", "industry": "Semiconductors", "marketCap": 82608000000000, "sector": "Technology"}, "ADIL": {"avgVolume": 95480, "description": "Adial Pharmaceuticals, Inc., a clinical-stage biopharmaceutical company, focuses on the development of therapeutics for the treatment or prevention of addiction and related disorders. Its lead product is AD04, a selective serotonin-3 antagonist, which is ", "industry": "Biotechnology", "marketCap": 5916000000, "sector": "Healthcare"}, "ADM": {"avgVolume": 2647086, "description": "Archer-Daniels-Midland Company procures, transports, stores, processes, and merchandises agricultural commodities, products, and ingredients in the United States, Switzerland, Cayman Islands, Brazil, Mexico, the United Kingdom, and internationally. The co", "industry": "Farm Products", "marketCap": 52687000000000, "sector": "Consumer Defensive"}, "ADMA": {"avgVolume": 3298678, "description": "ADMA Biologics, Inc., a biopharmaceutical company, engages in developing, manufacturing, and marketing specialty plasma-derived biologics for the treatment of immune deficiencies and infectious diseases in the United States and internationally. It offers ", "industry": "Biotechnology", "marketCap": 801878000000, "sector": "Healthcare"}, "ADMP": {"avgVolume": 1799439, "description": "Adamis Pharmaceuticals Corporation, a specialty biopharmaceutical company, develops and commercializes products in the therapeutic areas of allergy, opioid overdose, respiratory, and inflammatory disease in the United States. The company's product candida", "industry": "Drug Manufacturers-Specialty & Generic", "marketCap": 23157000000, "sector": "Healthcare"}, "ADN": {"avgVolume": 582216, "description": "Advent Technologies Holdings, Inc., an advanced materials and technology development company, operates in the fuel cell and hydrogen technology markets. It develops, manufactures, and assembles fuel cell systems and critical components that determine the ", "industry": "Utilities-Renewable", "marketCap": 88437000000, "sector": "Utilities"}, "ADNT": {"avgVolume": 769973, "description": "Adient plc, an investment holding company, engages in the design, development, manufacture, and market of seating systems and components for passenger cars, commercial vehicles, and light trucks. The company's automotive seating solutions include complete", "industry": "Auto Parts", "marketCap": 3254000000000, "sector": "Consumer Cyclical"}, "ADOC": {"avgVolume": 4685, "description": "Edoc Acquisition Corp. does not have significant operations. It focuses on effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses primarily in the health c", "industry": "Shell Companies", "marketCap": 50673000000, "sector": "Financial Services"}, "ADP": {"avgVolume": 1741180, "description": "Automatic Data Processing, Inc. provides cloud-based human capital management solutions worldwide. It operates in two segments, Employer Services and Professional Employer Organization (PEO). The Employer Services segment offers strategic, cloud-based pla", "industry": "Staffing & Employment Services", "marketCap": 99986000000000, "sector": "Industrials"}, "ADPT": {"avgVolume": 1006260, "description": "Adaptive Biotechnologies Corporation, a commercial-stage company, develops an immune medicine platform for the diagnosis and treatment of various diseases. The company offers immunoSEQ, a platform and core immunosequencing product that is used to answer t", "industry": "Biotechnology", "marketCap": 1023000000000, "sector": "Healthcare"}, "ADRT": {"avgVolume": 12245, "description": "Ault Disruptive Technologies Corporation does not have significant operations. It focuses on effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or other business combination with one or more businesses in techno", "industry": "Shell Companies", "marketCap": 147056000000, "sector": "Financial Services"}, "ADSE": {"avgVolume": 21919, "description": "ADS-TEC Energy PLC, a B2B technology company, develops, manufactures, and services intelligent battery buffered energy systems. The company supplies integrated technology platforms that enable customers to run their electric vehicle (EV) charging and ener", "industry": "Electrical Equipment & Parts", "marketCap": 151793000000, "sector": "Industrials"}, "ADSK": {"avgVolume": 1644147, "description": "Autodesk, Inc. provides 3D design, engineering, and entertainment software and services worldwide. The company offers AutoCAD Civil 3D, a surveying, design, analysis, and documentation solution for civil engineering, including land development, transporta", "industry": "Software-Application", "marketCap": 40195000000000, "sector": "Technology"}, "ADT": {"avgVolume": 5285844, "description": "ADT Inc. provides security, automation, and smart home solutions to consumer and business customers in the United States. It provides a range of fire detection, fire suppression, video surveillance, and access control systems to residential, commercial, a", "industry": "Security & Protection Services", "marketCap": 8322000000000, "sector": "Industrials"}, "ADTH": {"avgVolume": 102221, "description": "AdTheorent Holding Company, Inc., a digital media platform, provides machine learning platform for advertisers and marketers in the United States and Canada. The company offers predictive targeting, geo-intelligence, and cross-environment map solutions, a", "industry": "Advertising Agencies", "marketCap": 132092000000, "sector": "Communication Services"}, "ADTN": {"avgVolume": 569347, "description": "ADTRAN Holdings, Inc., through its subsidiaries, provides end-to-end fiber networking solutions for communications service provider, enterprises, and government customers in the United States, Germany, the United Kingdom, Mexico, and internationally. It o", "industry": "Communication Equipment", "marketCap": 144000000000, "sector": "Technology"}, "ADTX": {"avgVolume": 1734711, "description": "Aditxt, Inc., a biotech company, develops technologies focuses on improving the health of the immune system through immune mapping and reprogramming. It develops AditxtScore that allows individuals to understand, manage, and monitor their immune profiles ", "industry": "Biotechnology", "marketCap": 451000000, "sector": "Healthcare"}, "ADUS": {"avgVolume": 111080, "description": "Addus HomeCare Corporation, together with its subsidiaries, provides personal care services to elderly, chronically ill, disabled persons, and individuals who are at risk of hospitalization or institutionalization in the United States. It operates through", "industry": "Medical Care Facilities", "marketCap": 1584000000000, "sector": "Healthcare"}, "ADV": {"avgVolume": 659265, "description": "Advantage Solutions Inc. provides outsourced solutions to consumer goods companies and retailers in North America and internationally. It operates in two segments, Sales and Marketing. The Sales segment offers brand-centric services, such as headquarter r", "industry": "Advertising Agencies", "marketCap": 610596000000, "sector": "Communication Services"}, "ADVM": {"avgVolume": 537801, "description": "Adverum Biotechnologies, Inc., a clinical-stage gene therapy company, develops gene therapy product candidates to treat ocular and rare diseases. Its lead product candidate is ADVM-022, a single intravitreal injection gene therapy candidate used for the t", "industry": "Biotechnology", "marketCap": 53854000000, "sector": "Healthcare"}, "ADXN": {"avgVolume": 140122, "description": "Addex Therapeutics Ltd, a development-stage biopharmaceutical company, discovers, develops, and commercializes small-molecule pharmaceutical products for central nervous system (CNS) disorders in Switzerland. The company focuses on the discovery of oral s", "industry": "Biotechnology", "marketCap": 15136000000, "sector": "Healthcare"}, "ADXS": {"avgVolume": 3494, "description": "Advaxis, Inc., a clinical-stage biotechnology company, focuses on the discovery, development, and commercialization of proprietary Listeria monocytogenes (Lm) technology antigen delivery products in the United States. The company is developing ADXS-PSA, w", "industry": "Biotechnology", "marketCap": 1952000000, "sector": "Healthcare"}, "AE": {"avgVolume": 17578, "description": "Adams Resources & Energy, Inc., through its subsidiaries, primarily engages in the marketing, transportation, terminalling, and storage in various crude oil and natural gas basins in the United States. The company operates through three segments: Crude Oi", "industry": "Oil & Gas Refining & Marketing", "marketCap": 97973000000, "sector": "Energy"}, "AEAC": {"avgVolume": 35395, "description": "Authentic Equity Acquisition Corp. does not have significant operations. The company focuses on effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses. It ", "industry": "Shell Companies", "marketCap": 30285000000, "sector": "Financial Services"}, "AEAE": {"avgVolume": 39086, "description": "AltEnergy Acquisition Corp. does not have significant operations. The company focuses on effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar transaction with one or more businesses. It intends to acqui", "industry": "Shell Companies", "marketCap": 292387000000, "sector": "Financial Services"}, "AEE": {"avgVolume": 1405142, "description": "Ameren Corporation, together with its subsidiaries, operates as a public utility holding company in the United States. It operates through four segments: Ameren Missouri, Ameren Illinois Electric Distribution, Ameren Illinois Natural Gas, and Ameren Trans", "industry": "Utilities-Regulated Electric", "marketCap": 23339000000000, "sector": "Utilities"}, "AEFC": {"avgVolume": 58122, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "AEG": {"avgVolume": 2548029, "description": "Aegon N.V. provides insurance, pensions, and asset management services in the Americas, the Netherlands, and the United Kingdom. The company offers life, accident, and health insurance; savings, pension, annuities, and mutual funds; property and casualty ", "industry": "Insurance-Diversified", "marketCap": 10163000000000, "sector": "Financial Services"}, "AEHA": {"avgVolume": 5265, "description": "Aesther Healthcare Acquisition Corp. intends to effect a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses primarily in the pharmaceutical and medical devices sec", "industry": "Shell Companies", "marketCap": 137408000000, "sector": "Financial Services"}, "AEHL": {"avgVolume": 133490, "description": "Antelope Enterprise Holdings Limited, through its subsidiaries, manufactures and sells ceramic tiles for exterior siding and interior flooring, and design in residential and commercial buildings in the People's Republic of China. The company provides porc", "industry": "Building Products & Equipment", "marketCap": 3554000000, "sector": "Industrials"}, "AEHR": {"avgVolume": 1705975, "description": "Aehr Test Systems provides test systems for burning-in semiconductor devices in wafer level, singulated die, and package part form worldwide. Its products include ABTS system that is used in the production and qualification testing of packaged parts for l", "industry": "Semiconductor Equipment & Materials", "marketCap": 555957000000, "sector": "Technology"}, "AEI": {"avgVolume": 40318, "description": "Alset Inc., through its subsidiaries, engages in the real estate development, financial services, digital transformation technologies, biohealth, and consumer products businesses in the United States, Singapore, Hong Kong, Australia, and South Korea. It o", "industry": "Real Estate-Development", "marketCap": 22291000000, "sector": "Real Estate"}, "AEIS": {"avgVolume": 204029, "description": "Advanced Energy Industries, Inc. designs, manufactures, sells, and supports precision power conversion, measurement, and control solutions worldwide. It offers plasma power solutions, including direct current (DC), pulsed DC, low frequency alternating cur", "industry": "Electrical Equipment & Parts", "marketCap": 3139000000000, "sector": "Industrials"}, "AEL": {"avgVolume": 677586, "description": "American Equity Investment Life Holding Company, through its subsidiaries, provides life insurance products in the United States. The company issues fixed index and rate annuities, as well as single premium immediate annuities. It markets its products thr", "industry": "Insurance-Life", "marketCap": 3955000000000, "sector": "Financial Services"}, "AEM": {"avgVolume": 3086995, "description": "Agnico Eagle Mines Limited engages in the exploration, development, and production of mineral properties in Canada, Mexico, and Finland. It operates through Northern Business and Southern Business segments. The company primarily produces and sells gold de", "industry": "Gold", "marketCap": 24411000000000, "sector": "Basic Materials"}, "AEMD": {"avgVolume": 197655, "description": "Aethlon Medical, Inc., a medical technology company, focuses on developing products to diagnose and treat life and organ threatening diseases in the United States. The company develops Aethlon Hemopurifier, a clinical-stage immunotherapeutic device that r", "industry": "Medical Devices", "marketCap": 5792000000, "sector": "Healthcare"}, "AENZ": {"avgVolume": 53891, "description": "Aenza S.A.A., together with its subsidiaries, engages in the Infrastructure, Energy, Engineering and Construction, and Real Estate management businesses in Peru, Bolivia, Chile, Mexico, and Colombia. The company's Infrastructure segment offers long-term c", "industry": "Engineering & Construction", "marketCap": 245039000000, "sector": "Industrials"}, "AEO": {"avgVolume": 4998818, "description": "American Eagle Outfitters, Inc. operates as a specialty retailer that provides clothing, accessories, and personal care products under the American Eagle and Aerie brands. The company provides jeans, and specialty apparel and accessories for women and men", "industry": "Apparel Retail", "marketCap": 2641000000000, "sector": "Consumer Cyclical"}, "AEON": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "AEP": {"avgVolume": 3467042, "description": "American Electric Power Company, Inc., an electric public utility holding company, engages in the generation, transmission, and distribution of electricity for sale to retail and wholesale customers in the United States. It operates through Vertically Int", "industry": "Utilities-Regulated Electric", "marketCap": 4948000000000, "sector": "Utilities"}, "AER": {"avgVolume": 894037, "description": "AerCap Holdings N.V. engages in the lease, financing, sale, and management of commercial flight equipment in China, Hong Kong, Macau, the United States, Ireland, and internationally. The company offers aircraft asset management services, such as remarketi", "industry": "Rental & Leasing Services", "marketCap": 14109000000000, "sector": "Industrials"}, "AERC": {"avgVolume": 1591018, "description": "AeroClean Technologies, Inc., an interior space air purification technology company, provides air purification solutions for hospitals and other healthcare facilities. It offers interior air sterilization and disinfection products for the eradication of h", "industry": "Pollution & Treatment Controls", "marketCap": 47885000000, "sector": "Industrials"}, "AERI": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "AES": {"avgVolume": 4195759, "description": "The AES Corporation operates as a diversified power generation and utility company. It owns and/or operates power plants to generate and sell power to customers, such as utilities, industrial users, and other intermediaries. The company also owns and/or o", "industry": "Utilities-Diversified", "marketCap": 1925000000000, "sector": "Utilities"}, "AESC": {"avgVolume": 47767, "description": "The AES Corporation operates as a diversified power generation and utility company. It owns and/or operates power plants to generate and sell power to customers, such as utilities, industrial users, and other intermediaries. The company also owns and/or o", "industry": "Utilities-Diversified", "marketCap": -1, "sector": "Utilities"}, "AESE": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "AEVA": {"avgVolume": 1389067, "description": "Aeva Technologies, Inc., through its frequency modulated continuous wave (FMCW) sensing technology, designs a 4D LiDAR-on-chip that enables the adoption of LiDAR across various applications. from automated driving to consumer electronics, consumer health,", "industry": "Auto Parts", "marketCap": 266242000000, "sector": "Consumer Cyclical"}, "AEY": {"avgVolume": 72883, "description": "ADDvantage Technologies Group, Inc., through its subsidiaries, distributes and services electronics and hardware for the telecommunications industry in the United States and internationally. It operates through two segments, Wireless Infrastructure Servic", "industry": "Electronics & Computer Distribution", "marketCap": 19908000000, "sector": "Technology"}, "AEYE": {"avgVolume": 11695, "description": "AudioEye, Inc. provides patented, internet content publication, distribution software, and related services to Internet, print, broadcast, and other media to people regardless of their network connection, device, location, or disabilities in the United St", "industry": "Software-Application", "marketCap": 44424000000, "sector": "Technology"}, "AEZS": {"avgVolume": 13900, "description": "Aeterna Zentaris Inc., a specialty biopharmaceutical company, engages in developing and commercializing therapeutics and diagnostic tests. Its lead product is macimorelin, an orally available peptidomimetic ghrelin receptor (GHSR-1a) agonist that stimulat", "industry": "Biotechnology", "marketCap": 14956000000, "sector": "Healthcare"}, "AFAC": {"avgVolume": 80825, "description": "Arena Fortify Acquisition Corp. does not have significant operations. The company focuses on effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses. It int", "industry": "Shell Companies", "marketCap": 221447000000, "sector": "Financial Services"}, "AFAQ": {"avgVolume": 114899, "description": "AF Acquisition Corp. does not have significant operations. It focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. AF Acquisition Corp. was incorpora", "industry": "Shell Companies", "marketCap": 28056000000, "sector": "Financial Services"}, "AFAR": {"avgVolume": 41462, "description": "Aura FAT Projects Acquisition Corp does not have significant operations. It intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses in technology companies ", "industry": "Shell Companies", "marketCap": 148088000000, "sector": "Financial Services"}, "AFBI": {"avgVolume": 2465, "description": "Affinity Bancshares, Inc. operates as the holding company for Affinity Bank that provides various banking products and services. The company accepts various deposit accounts, including savings accounts, checking accounts, certificates of deposit, and indi", "industry": "Banks-Regional", "marketCap": 96461000000, "sector": "Financial Services"}, "AFCG": {"avgVolume": 129829, "description": "AFC Gamma, Inc. originates, structures, underwrites, and invests in senior secured loans, and other types of loans and debt securities for established companies operating in the cannabis industry in states that have legalized medicinal and/or adult use ca", "industry": "REIT-Specialty", "marketCap": 333359000000, "sector": "Real Estate"}, "AFG": {"avgVolume": 415959, "description": "American Financial Group, Inc., an insurance holding company, provides specialty property and casualty insurance products in the United States. It offers property and transportation insurance products, such as physical damage and liability coverage for bu", "industry": "Insurance-Property & Casualty", "marketCap": 1178000000000, "sector": "Financial Services"}, "AFGB": {"avgVolume": 9547, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "AFGC": {"avgVolume": 17604, "description": "", "industry": "", "marketCap": 21279000000, "sector": ""}, "AFGD": {"avgVolume": 9936, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "AFGE": {"avgVolume": 4750, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "AFIB": {"avgVolume": 546737, "description": "Acutus Medical, Inc., an arrhythmia management company, designs, manufactures, and markets a range of tools for catheter-based ablation procedures to treat various arrhythmias in the United States and internationally. The company's product portfolio inclu", "industry": "Medical Devices", "marketCap": 29306000000, "sector": "Healthcare"}, "AFL": {"avgVolume": 2705039, "description": "Aflac Incorporated, through its subsidiaries, provides supplemental health and life insurance products. It operates through two segments, Aflac Japan and Aflac U.S. The Aflac Japan segment offers cancer, medical, nursing care income support, GIFT, and who", "industry": "Insurance-Life", "marketCap": 4565000000000, "sector": "Financial Services"}, "AFMD": {"avgVolume": 2071673, "description": "Affimed N.V., a clinical-stage biopharmaceutical company, focuses on discovering and developing cancer immunotherapies in the United States, Germany, and rest of Europe. Its lead product candidate is AFM13, which has completed Phase II clinical study for ", "industry": "Biotechnology", "marketCap": 16726000000, "sector": "Healthcare"}, "AFRI": {"avgVolume": 18283, "description": "Forafric Global PLC engages in the purchase, storage, transport, processing, and sale of agricultural commodities and commodity products in Morocco and Sub-Saharan Africa. The company offers flour and semolina; and secondary processing products, such as p", "industry": "Farm Products", "marketCap": 306634000000, "sector": "Consumer Defensive"}, "AFRM": {"avgVolume": 14297636, "description": "Affirm Holdings, Inc. operates a platform for digital and mobile-first commerce in the United States, Canada, and internationally. The company's platform includes point-of-sale payment solution for consumers, merchant commerce solutions, and a consumer-fo", "industry": "Software-Infrastructure", "marketCap": 2585000000000, "sector": "Technology"}, "AFTR": {"avgVolume": 76613, "description": "AfterNext HealthTech Acquisition Corp. does not have significant operations. It intends to effect a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or other similar business combination with one or more operating busines", "industry": "Shell Companies", "marketCap": 3125000000, "sector": "Financial Services"}, "AFYA": {"avgVolume": 369195, "description": "Afya Limited, through its subsidiaries, operates as a medical education group in Brazil. It offers educational products and services, including medical schools, medical residency preparatory courses, graduate courses, and other programs to lifelong medica", "industry": "Education & Training Services", "marketCap": 1393000000000, "sector": "Consumer Defensive"}, "AG": {"avgVolume": 7097137, "description": "First Majestic Silver Corp. engages in the acquisition, exploration, development, and production of mineral properties with a focus on silver and gold production in North America. It holds 100% interests in the San Dimas Silver/Gold Mine covering an area ", "industry": "Silver", "marketCap": 2349000000000, "sector": "Basic Materials"}, "AGAC": {"avgVolume": 121157, "description": "African Gold Acquisition Corporation does not have significant operations. The company focuses on effecting a merger or mergers, asset acquisition, share purchase, reorganization, or other similar business combination with one or more businesses. African ", "industry": "Shell Companies", "marketCap": 519829000000, "sector": "Financial Services"}, "AGAE": {"avgVolume": 84919, "description": "Allied Gaming & Entertainment Inc. provides entertainment and gaming products worldwide. It operates esports properties to connect players and fans through a network of connected arenas; a flagship gaming arena located at the Luxor Hotel in Las Vegas, Nev", "industry": "Entertainment", "marketCap": 39086000000, "sector": "Communication Services"}, "AGBA": {"avgVolume": 175895, "description": "AGBA Group Holding Limited focuses on operating a full-service platform to banks, other financial institutions, brokers, and individual financial advisors to advise and serve its retail clients. The company offers a range of financial products, such as li", "industry": "Shell Companies", "marketCap": 105015000000, "sector": "Financial Services"}, "AGCB": {"avgVolume": 511508, "description": "Altimeter Growth Corp. 2 does not have significant operations. It focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses or entities. Altimeter Growth Co", "industry": "Shell Companies", "marketCap": 579522000000, "sector": "Financial Services"}, "AGCO": {"avgVolume": 605983, "description": "AGCO Corporation manufactures and distributes agricultural equipment and related replacement parts worldwide. It offers horsepower tractors for row crop production, soil cultivation, planting, land leveling, seeding, and commercial hay operations; utility", "industry": "Farm & Heavy Construction Machinery", "marketCap": 10063000000000, "sector": "Industrials"}, "AGE": {"avgVolume": 26170, "description": "AgeX Therapeutics, Inc., a biotechnology company, focuses on the development and commercialization of novel therapeutics targeting human aging and degenerative diseases in the United States. The company's lead cell-based therapeutic candidates in developm", "industry": "Biotechnology", "marketCap": 20871000000, "sector": "Healthcare"}, "AGEN": {"avgVolume": 4710121, "description": "Agenus Inc., a clinical-stage immuno-oncology company, discovers and develops immuno-oncology products in the United States and internationally. The company offers Retrocyte Display, an antibody expression platform for the identification of fully human an", "industry": "Biotechnology", "marketCap": 707164000000, "sector": "Healthcare"}, "AGFS": {"avgVolume": 834280, "description": "AgroFresh Solutions, Inc. provides science-based solutions, data-driven technologies, and high-touch customer services. The company's flagship product is the SmartFresh system that regulates the post-harvest ripening effects of ethylene to preserve the te", "industry": "Farm Products", "marketCap": 156505000000, "sector": "Consumer Defensive"}, "AGFY": {"avgVolume": 2492348, "description": "Agrify Corporation develops precision hardware and software cultivation and extraction solutions for the cannabis and hemp industry in the United States. The company offers vertical farming units and Agrify Insights Software-as-a-Service software; integra", "industry": "Engineering & Construction", "marketCap": 2915000000, "sector": "Industrials"}, "AGGR": {"avgVolume": 30281, "description": "Agile Growth Corp. does not have significant operations. It focuses on effecting a merger, share exchange, asset acquisition, share purchase, recapitalization, reorganization, or similar business combination with one or more businesses or entities. The co", "industry": "Shell Companies", "marketCap": 3906000000, "sector": "Financial Services"}, "AGI": {"avgVolume": 3756545, "description": "Alamos gold holding oorperatief u.a. operates as a subsidiary of Alamos Gold Inc.", "industry": "Gold", "marketCap": 4049000000000, "sector": "Basic Materials"}, "AGIL": {"avgVolume": 20822, "description": "AgileThought, Inc. provides digital transformation services in the United States and Latin America. It offers product management services comprising AgileIgnite and DevOpsIgnite; user experience, application engineering, modernization and mobility, advanc", "industry": "Software-Application", "marketCap": 210341000000, "sector": "Technology"}, "AGIO": {"avgVolume": 502650, "description": "Agios Pharmaceuticals, Inc., a biopharmaceutical company, engages in the discovery and development of medicines in the field of cellular metabolism and adjacent areas of biology. The company offers PYRUKYND (mitapivat) an activator of both wild-type and a", "industry": "Biotechnology", "marketCap": 1464000000000, "sector": "Healthcare"}, "AGL": {"avgVolume": 1791300, "description": "agilon health, inc. offers healthcare services for seniors through primary care physicians in the communities of the United States. As of December 31, 2021, it served approximately 238,000 senior members, which included 186,300 medicare advantage members ", "industry": "Medical Care Facilities", "marketCap": 6635000000000, "sector": "Healthcare"}, "AGLE": {"avgVolume": 1983803, "description": "Aeglea BioTherapeutics, Inc., a clinical-stage biotechnology company, designs and develops human enzyme therapeutics for the treatment of patients and families with rare metabolic diseases. The company's lead product candidate is pegzilarginase, a recombi", "industry": "Biotechnology", "marketCap": 23885000000, "sector": "Healthcare"}, "AGM": {"avgVolume": 35342, "description": "Federal Agricultural Mortgage Corporation provides a secondary market for various loans made to borrowers in the United States. It operates through four segments: Farm & Ranch, USDA (United States Department of Agriculture) Guarantees, Rural Utilities, an", "industry": "Credit Services", "marketCap": 1197000000000, "sector": "Financial Services"}, "AGMH": {"avgVolume": 12116, "description": "AGM Group Holdings Inc. operates as a technology company. The company offers MetaTrader 5, a futures trading solution; FXSC, a retail-orientated online trading education website; and foreign exchange trading system that provides services to financial inst", "industry": "Software-Application", "marketCap": 39778000000, "sector": "Technology"}, "AGNC": {"avgVolume": 15576881, "description": "AGNC Investment Corp. operates as a real estate investment trust (REIT) in the United States. The company invests in residential mortgage pass-through securities and collateralized mortgage obligations for which the principal and interest payments are gua", "industry": "REIT-Mortgage", "marketCap": 6111000000000, "sector": "Real Estate"}, "AGO": {"avgVolume": 324659, "description": "Assured Guaranty Ltd., through its subsidiaries, provides credit protection products to public finance, infrastructure, and structured finance markets in the United States and internationally. The company operates in two segments, Insurance and Asset Mana", "industry": "Insurance-Specialty", "marketCap": 3753000000000, "sector": "Financial Services"}, "AGR": {"avgVolume": 598421, "description": "Avangrid, Inc., an energy services holding company, engages in the regulated energy transmission and distribution, and renewable energy generation businesses in the United States. The company operates through Networks and Renewables segments. It is involv", "industry": "Utilities-Regulated Electric", "marketCap": 16807000000000, "sector": "Utilities"}, "AGRI": {"avgVolume": 150218, "description": "AgriFORCE Growing Systems Ltd., an agriculture-focused technology company, focuses on the development and commercialization of plant-based ingredients and products for businesses and consumers that deliver healthier and nutritious solutions. It also engag", "industry": "Farm Products", "marketCap": 16185000000, "sector": "Consumer Defensive"}, "AGRO": {"avgVolume": 641200, "description": "Adecoagro S.A. operates as an agro-industrial company in South America. It engages in farming crops and other agricultural products, dairy operations, and land transformation activities, as well as sugar, ethanol, and energy production activities. The com", "industry": "Farm Products", "marketCap": 902954000000, "sector": "Consumer Defensive"}, "AGRX": {"avgVolume": 834411, "description": "Agile Therapeutics, Inc., a women's healthcare company, researches, develops, and commercializes prescription contraceptive products for women in the United States. Its lead product is Twirla, also known as AG200-15, a once-weekly prescription combination", "industry": "Drug Manufacturers-Specialty & Generic", "marketCap": 8001000000, "sector": "Healthcare"}, "AGS": {"avgVolume": 356024, "description": "PlayAGS, Inc. designs and supplies gaming products and services for the gaming industry in the United States and internationally. It operates through three segments: Electronic Gaming Machines (EGM), Table Products, and Interactive Games (Interactive). Th", "industry": "Gambling", "marketCap": 181999000000, "sector": "Consumer Cyclical"}, "AGTC": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "AGTI": {"avgVolume": 393729, "description": "Agiliti, Inc., together with its subsidiaries, provides healthcare technology management and service solutions to the healthcare industry in the United States. It offers onsite managed services that are comprehensive programs for the management, reprocess", "industry": "Health Information Services", "marketCap": 2139000000000, "sector": "Healthcare"}, "AGX": {"avgVolume": 67754, "description": "Argan, Inc., through its subsidiaries, provides engineering, procurement, construction, commissioning, operations management, maintenance, project development, technical, and consulting services to the power generation and renewable energy markets. The co", "industry": "Engineering & Construction", "marketCap": 499472000000, "sector": "Industrials"}, "AGYS": {"avgVolume": 163098, "description": "Agilysys, Inc., together with its subsidiaries, operates as a developer and marketer of hardware and software products and services to the hospitality industry in North America, Europe, the Asia-Pacific, and India. It offers point of sale, property manage", "industry": "Software-Application", "marketCap": 1982000000000, "sector": "Technology"}, "AHCO": {"avgVolume": 837996, "description": "AdaptHealth Corp., together with its subsidiaries, provides home medical equipment (HME), medical supplies, and home and related services in the United States. The company provides sleep therapy equipment, supplies, and related services, such as CPAP and ", "industry": "Medical Devices", "marketCap": 2565000000000, "sector": "Healthcare"}, "AHG": {"avgVolume": 258667, "description": "Akso Health Group operates a social e-commerce mobile platform in China. The company operates Xiaobai Maimai App, which offers food and beverage products, wine, cosmetic products, fashion and apparel, entertainment products, housewares, home appliances, e", "industry": "Credit Services", "marketCap": 8339000000, "sector": "Financial Services"}, "AHH": {"avgVolume": 330501, "description": "Armada Hoffler Properties, Inc. (NYSE: AHH) is a vertically-integrated, self-managed real estate investment trust (\"REIT\") with four decades of experience developing, building, acquiring, and managing high-quality, institutional-grade office, retail, and ", "industry": "REIT-Diversified", "marketCap": 1015000000000, "sector": "Real Estate"}, "AHI": {"avgVolume": 252129, "description": "Advanced Health Intelligence Ltd. operates as a mobile application and technology development company in Australia and internationally. It develops and patents BodyScan, a proprietary measurement/dimensioning technology that enables end-user to check and ", "industry": "Software-Application", "marketCap": 10419000000, "sector": "Technology"}, "AHPA": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "AHPI": {"avgVolume": 32808, "description": "Allied Healthcare Products, Inc. manufactures and markets respiratory products for use in the health care industry in a range of hospitals and alternate site settings worldwide. The company offers respiratory care/anesthesia products, including air compre", "industry": "Medical Devices", "marketCap": 3813000000, "sector": "Healthcare"}, "AHRN": {"avgVolume": 54613, "description": "Ahren Acquisition Corp. does not have significant operations. The company focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. It intends to identify", "industry": "Shell Companies", "marketCap": 382873000000, "sector": "Financial Services"}, "AHT": {"avgVolume": 401250, "description": "Ashford Hospitality Trust is a real estate investment trust (REIT) focused on investing predominantly in upper upscale, full-service hotels.", "industry": "REIT-Hotel & Motel", "marketCap": 153531000000, "sector": "Real Estate"}, "AI": {"avgVolume": 1599062, "description": "C3.ai, Inc. operates as an enterprise artificial intelligence (AI) software company in North America, Europe, the Middle East, Africa, the Asia Pacific, and internationally. It provides C3 AI application platform, an application development and runtime en", "industry": "Information Technology Services", "marketCap": 1147000000000, "sector": "Technology"}, "AIB": {"avgVolume": 13244, "description": "AIB Acquisition Corporation does not have significant operations. It intends to effect a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses in the fintech industri", "industry": "Shell Companies", "marketCap": 114772000000, "sector": "Financial Services"}, "AIC": {"avgVolume": 1668, "description": "", "industry": "", "marketCap": 623591000000, "sector": ""}, "AIG": {"avgVolume": 4914419, "description": "American International Group, Inc. offers insurance products for commercial, institutional, and individual customers in North America and internationally. The company's General Insurance segment provides general liability, environmental, commercial automo", "industry": "Insurance-Diversified", "marketCap": 47053000000000, "sector": "Financial Services"}, "AIH": {"avgVolume": 6204, "description": "Aesthetic Medical International Holdings Group Limited provides aesthetic medical services. It offers surgical aesthetic treatments, such as eye surgery, rhinoplasty, breast augmentation, and liposuction; and non-surgical aesthetic treatments comprising m", "industry": "Medical Care Facilities", "marketCap": 42695000000, "sector": "Healthcare"}, "AIHS": {"avgVolume": 53198, "description": "Senmiao Technology Limited engages in the automobile transaction and related services business in the People's Republic of China. The company offers car rental services to individual customers; and auto finance solutions through financing leases. It also ", "industry": "Credit Services", "marketCap": 6915000000, "sector": "Financial Services"}, "AIKI": {"avgVolume": 38683, "description": "AIkido Pharma Inc., a biotechnology company, focuses on developing small-molecule anti-cancer therapeutics. The company's pipeline of therapeutics includes therapies for prostate cancer, pancreatic cancer, acute myeloid leukemia (AML), and acute lymphobla", "industry": "Biotechnology", "marketCap": 19527000000, "sector": "Healthcare"}, "AIM": {"avgVolume": 143403, "description": "AIM ImmunoTech Inc., an immuno-pharma company, focuses on the research and development of therapeutics to treat multiple types of cancers, viral diseases, and immune-deficiency disorders in the United States. The company's products include Ampligen, a dru", "industry": "Biotechnology", "marketCap": 1681000000, "sector": "Healthcare"}, "AIMC": {"avgVolume": 1101911, "description": "Altra Industrial Motion Corp. designs, produces, and markets a range of electromechanical power transmission motion control products for use in various motion-related applications, and high-volume manufacturing and non-manufacturing processes. It operates", "industry": "Specialty Industrial Machinery", "marketCap": 3884000000000, "sector": "Industrials"}, "AIMD": {"avgVolume": 623908, "description": "Ainos, Inc., a healthcare company, engages in the developing medical technologies for point-of-care testing and safe and novel medical treatment for disease indications. The company offers COVID-19 antigen rapid test kit and Ainos' cloud-based test manage", "industry": "Biotechnology", "marketCap": 12575000000, "sector": "Healthcare"}, "AIN": {"avgVolume": 131468, "description": "Albany International Corp., together with its subsidiaries, engages in the textile and materials processing business. The company operates in two segments, Machine Clothing (MC) and Albany Engineered Composites (AEC). The MC segment designs, manufactures,", "industry": "Textile Manufacturing", "marketCap": 3068000000000, "sector": "Consumer Cyclical"}, "AINC": {"avgVolume": 12363, "description": "Ashford, Inc is an asset management firm. The firm provides investment management and related services to the real estate and hospitality sectors. Ashford, Inc was formed on April 2, 2014 and is based in Dallas, Texas. Ashford Inc.(NYSEAM:AINC) operates i", "industry": "Asset Management", "marketCap": 44109000000, "sector": "Financial Services"}, "AIO": {"avgVolume": 144975, "description": "", "industry": "", "marketCap": 554951000000, "sector": ""}, "AIP": {"avgVolume": 98657, "description": "Arteris, Inc. provides semiconductor interconnect intellectual property (IP) and IP deployment solutions in the Americas, the Asia Pacific, Europe, and the Middle East. The company develops, licenses, and supports the on-chip interconnect fabric technolog", "industry": "Semiconductors", "marketCap": 134369000000, "sector": "Technology"}, "AIR": {"avgVolume": 235986, "description": "AAR Corp. provides products and services to commercial aviation, government, and defense markets worldwide. The Aviation Services segment offers aftermarket support and services; inventory management and distribution services; and maintenance, repair, and", "industry": "Aerospace & Defense", "marketCap": 1527000000000, "sector": "Industrials"}, "AIRC": {"avgVolume": 974834, "description": "AIR is a real estate investment trust focused on the ownership and management of quality apartment communities located in the largest markets in the United States. AIR is one of the country's largest owners and operators of apartments, with 99 communities", "industry": "REIT-Residential", "marketCap": 5137000000000, "sector": "Real Estate"}, "AIRG": {"avgVolume": 27036, "description": "Airgain, Inc. designs, develops, and engineers antenna products for original equipment and design manufacturers, vertical markets, chipset vendors, service providers, value-added resellers and software developers worldwide. The company's products include ", "industry": "Communication Equipment", "marketCap": 61852000000, "sector": "Technology"}, "AIRI": {"avgVolume": 11187, "description": "Air Industries Group, an aerospace and defense company, designs, manufactures, and sells structural parts and assemblies for mission-critical aerospace and defense applications, and a prime contractor to the U.S. Department of Defense in the United States", "industry": "Aerospace & Defense", "marketCap": 14453000000, "sector": "Industrials"}, "AIRS": {"avgVolume": 302357, "description": "AirSculpt Technologies, Inc., together with its subsidiaries, focuses on operating as a holding company for EBS Intermediate Parent LLC that provides body contouring procedure services in the United States. It offers custom body contouring using its AirSc", "industry": "Medical Care Facilities", "marketCap": 187054000000, "sector": "Healthcare"}, "AIRT": {"avgVolume": 6209, "description": "Air T, Inc., through its subsidiaries, provides overnight air cargo, ground equipment sale, and commercial jet engines and parts in the United States and internationally. The company's Overnight Air Cargo segment offers air express delivery services. As o", "industry": "Integrated Freight & Logistics", "marketCap": 68182000000, "sector": "Industrials"}, "AIT": {"avgVolume": 191813, "description": "Applied Industrial Technologies, Inc. distributes industrial motion, power, control, and automation technology solutions in North America, Australia, New Zealand, and Singapore. It operates through two segments, Service Center Based Distribution, and Flui", "industry": "Industrial Distribution", "marketCap": 4912000000000, "sector": "Industrials"}, "AIU": {"avgVolume": 22509, "description": "Meta Data Limited provides tutoring services for the students of kindergarten and primary, middle, and high schools (K12) in the People's Republic of China. It offers premium tutoring services for exam preparation under the OneSmart VIP brand; young child", "industry": "Education & Training Services", "marketCap": 17769000000, "sector": "Consumer Defensive"}, "AIV": {"avgVolume": 1370408, "description": "Aimco is a Real Estate Investment Trust focused on property development, redevelopment, and various other value-creating investment strategies, targeting the U.S. multifamily market. Aimco's mission is to make real estate investments where outcomes are en", "industry": "REIT-Residential", "marketCap": 108000000000, "sector": "Real Estate"}, "AIZ": {"avgVolume": 588954, "description": "Assurant, Inc., together with its subsidiaries, provides lifestyle and housing solutions that support, protect, and connect consumer purchases in North America, Latin America, Europe, and the Asia Pacific. The company operates through two segments: Global", "industry": "Insurance-Specialty", "marketCap": 6581000000000, "sector": "Financial Services"}, "AIZN": {"avgVolume": 15750, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "AJG": {"avgVolume": 912883, "description": "Arthur J. Gallagher & Co., together with its subsidiaries, provides insurance brokerage, consulting, third-party claims settlement, and administration services in the United States, Australia, Bermuda, Canada, the Caribbean, New Zealand, India, and the Un", "industry": "Insurance Brokers", "marketCap": 39908000000000, "sector": "Financial Services"}, "AJRD": {"avgVolume": 956036, "description": "Aerojet Rocketdyne Holdings, Inc. designs, develops, manufactures, and sells aerospace and defense products and systems in the United States. It operates in two segments, Aerospace and Defense, and Real Estate. The Aerospace and Defense segment offers aer", "industry": "Aerospace & Defense", "marketCap": 4504000000000, "sector": "Industrials"}, "AJX": {"avgVolume": 69036, "description": "Great Ajax Corp., real estate company, acquires, invests in, and manages a portfolio of residential mortgage and small balance commercial mortgage loans. The company also holds real estate owned properties acquired upon the foreclosure or other settlement", "industry": "REIT-Mortgage", "marketCap": 164369000000, "sector": "Real Estate"}, "AKA": {"avgVolume": 83762, "description": "a.k.a. Brands Holding Corp. operates a portfolio of online fashion brands in the United States, Australia, and internationally. It offers apparel, footwear, and accessories through its online stores under the Princess Polly, Culture Kings, Petal & Pup, mn", "industry": "Internet Retail", "marketCap": 158444000000, "sector": "Consumer Cyclical"}, "AKAM": {"avgVolume": 1578973, "description": "Akamai Technologies, Inc. provides cloud services for securing, delivering, and optimizing content and business applications over the internet in the United States and internationally. The company offers cloud solutions to keep infrastructure, websites, a", "industry": "Software-Infrastructure", "marketCap": 1313000000000, "sector": "Technology"}, "AKAN": {"avgVolume": 725052, "description": "Akanda Corp., through its subsidiaries, engages in the cultivation, manufacture, and distribution of cannabis products in the United Kingdom, Lesotho, and internationally. It intends to supply cannabis based medical and wellness products. The company was ", "industry": "Drug Manufacturers-Specialty & Generic", "marketCap": 4871000000, "sector": "Healthcare"}, "AKBA": {"avgVolume": 1503886, "description": "Akebia Therapeutics, Inc., a biopharmaceutical company, focuses on the development and commercialization of therapeutics for patients with kidney diseases. The company's lead product investigational product candidate is vadadustat, an oral therapy, which ", "industry": "Biotechnology", "marketCap": 75719000000, "sector": "Healthcare"}, "AKIC": {"avgVolume": 70114, "description": "Sports Ventures Acquisition Corp. does not have significant operations. The company focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. It intends t", "industry": "Shell Companies", "marketCap": 297041000000, "sector": "Financial Services"}, "AKLI": {"avgVolume": 139132, "description": "Akili, Inc., a digital medicine company, develops digital therapeutics for cognitive impairments. It provides EndeavorRx, a physician-prescribed video game-based treatment designed to directly target cognitive functioning. The company is based in Boston, ", "industry": "Health Information Services", "marketCap": 77909000000, "sector": "Healthcare"}, "AKR": {"avgVolume": 646755, "description": "Acadia Realty Trust is an equity real estate investment trust focused on delivering long-term, profitable growth via its dual \u0096 Core Portfolio and Fund \u0096 operating platforms and its disciplined, location-driven investment strategy. Acadia Realty Trust is ", "industry": "REIT-Retail", "marketCap": 1443000000000, "sector": "Real Estate"}, "AKRO": {"avgVolume": 802201, "description": "Akero Therapeutics, Inc., a cardio-metabolic nonalcoholic steatohepatitis (NASH) company, engages in the development of medicines designed to restore metabolic balance and improve overall health. The company's lead product candidate is efruxifermin (EFX),", "industry": "Biotechnology", "marketCap": 2325000000000, "sector": "Healthcare"}, "AKTS": {"avgVolume": 414280, "description": "Akoustis Technologies, Inc., through its subsidiary, Akoustis, Inc., designs, develops, manufactures, and sells radio frequency (RF) filter products for the mobile wireless device industry in the United States, Asia, Europe, and internationally. It operat", "industry": "Communication Equipment", "marketCap": 137927000000, "sector": "Technology"}, "AKTX": {"avgVolume": 78460, "description": "Akari Therapeutics, Plc, a clinical-stage biopharmaceutical company, focuses on developing advanced therapies for autoimmune and inflammatory diseases. Its lead product candidate is nomacopan, a second-generation complement inhibitor that prevents inflamm", "industry": "Biotechnology", "marketCap": 26114000000, "sector": "Healthcare"}, "AKU": {"avgVolume": 98427, "description": "Akumin Inc. provides outpatient diagnostic imaging services in the United States. It operates in two segments, Radiology and Oncology. The company offers various medical imaging services, including magnetic resonance imaging, computed tomography, positron", "industry": "Diagnostics & Research", "marketCap": 60055000000, "sector": "Healthcare"}, "AKUS": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "AKYA": {"avgVolume": 116729, "description": "Akoya Biosciences, Inc., a life sciences technology company, provides spatial biology solutions focused on transforming discovery and clinical research in North America, the Asia Pacific, Europe, the Middle East, and Africa. The company offers PhenoCycler", "industry": "Medical Instruments & Supplies", "marketCap": 340464000000, "sector": "Healthcare"}, "AL": {"avgVolume": 456772, "description": "Air Lease Corporation, an aircraft leasing company, engages in the purchase and leasing of commercial jet aircraft to airlines worldwide. It also sells aircraft from its operating lease portfolio to third parties, including other leasing companies, financ", "industry": "Rental & Leasing Services", "marketCap": 4228000000000, "sector": "Industrials"}, "AL-A": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "ALB": {"avgVolume": 1455265, "description": "Albemarle Corporation develops, manufactures, and markets engineered specialty chemicals worldwide. It operates through three segments: Lithium, Bromine, and Catalysts. The Lithium segment offers lithium compounds, including lithium carbonate, lithium hyd", "industry": "Specialty Chemicals", "marketCap": 25089000000000, "sector": "Basic Materials"}}