{"A": {"avgVolume": 1351606, "description": "Agilent Technologies, Inc. provides application focused solutions to the life sciences, diagnostics, and applied chemical markets worldwide. The Life Sciences and Applied Markets segment offers liquid chromatography systems and components; liquid chromato", "industry": "Diagnostics & Research", "marketCap": 44183000000000, "sector": "Healthcare"}, "AA": {"avgVolume": 6841890, "description": "Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through three segments: Bauxit", "industry": "Aluminum", "marketCap": 7821000000000, "sector": "Basic Materials"}, "AAC": {"avgVolume": 587674, "description": "Ares Acquisition Corporation does not have significant operations. It intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. The company was incorporated ", "industry": "Shell Companies", "marketCap": 1259000000000, "sector": "Financial Services"}, "AACG": {"avgVolume": 8173, "description": "ATA Creativity Global, together with its subsidiaries, provides educational services to individual students through its training center network in China and internationally. Its educational services include portfolio training, research-based learning, ove", "industry": "Education & Training Services", "marketCap": 45183000000, "sector": "Consumer Defensive"}, "AACI": {"avgVolume": 8271, "description": "Armada Acquisition Corp. I focuses on effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or related business combination with one or more businesses. It intends to focus on target businesses that provide technol", "industry": "Shell Companies", "marketCap": 208338000000, "sector": "Financial Services"}, "AADI": {"avgVolume": 87726, "description": "Aadi Bioscience, Inc., a clinical-stage biopharmaceutical company, engages in developing and commercializing precision therapies for genetically defined cancers with alterations in mTOR pathway genes. Its lead drug candidate, FYARRO is a form of sirolimus", "industry": "Biotechnology", "marketCap": 305427000000, "sector": "Healthcare"}, "AAIC": {"avgVolume": 71860, "description": "Arlington Asset Investment Corp. (NYSE: AAIC) currently invests primarily in mortgage related and residential real estate and has elected to be taxed as a REIT. The Company is headquartered in the Washington, D.C. metropolitan area. For more information, ", "industry": "REIT-Mortgage", "marketCap": 81412000000, "sector": "Real Estate"}, "AAIN": {"avgVolume": 2406, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "AAL": {"avgVolume": 30436158, "description": "American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas/Fort Worth, Los Angeles, Miami, N", "industry": "Airlines", "marketCap": 826000000000, "sector": "Industrials"}, "AAMC": {"avgVolume": 3711, "description": "Altisource Asset Management Corporation is an alternative lending company that provides liquidity and capital to under-served market and portfolio management and corporate governance services to institutional investors in the United States. The company of", "industry": "Asset Management", "marketCap": 34833000000, "sector": "Financial Services"}, "AAME": {"avgVolume": 3201, "description": "Atlantic American Corporation, through its subsidiaries, provides life and health, and property and casualty insurance products in the United States. The company operates through American Southern and Bankers Fidelity segments. It offers property and casu", "industry": "Insurance-Life", "marketCap": 49289000000, "sector": "Financial Services"}, "AAN": {"avgVolume": 477041, "description": "The Aaron's Company, Inc. provides lease-to-own and purchase solutions. The company engages in direct-to-consumer sales and lease ownership of furniture, appliances, electronics, computers, and accessories through company-operated and franchised stores in", "industry": "Rental & Leasing Services", "marketCap": 349974000000, "sector": "Industrials"}, "AAOI": {"avgVolume": 210463, "description": "Applied Optoelectronics, Inc. designs, manufactures, and sells various fiber-optic networking products worldwide. It offers optical modules, lasers, subassemblies, transmitters and transceivers, and turn-key equipment, as well as headend, node, and distri", "industry": "Semiconductors", "marketCap": 55621000000, "sector": "Technology"}, "AAON": {"avgVolume": 185276, "description": "AAON, Inc., together with its subsidiaries, engages in engineering, manufacturing, marketing, and selling air conditioning and heating equipment in the United States and Canada. The company operates through three segments: AAON Oklahoma, AAON Coil Product", "industry": "Building Products & Equipment", "marketCap": 4036000000000, "sector": "Industrials"}, "AAP": {"avgVolume": 1008385, "description": "Advance Auto Parts, Inc. provides automotive replacement parts, accessories, batteries, and maintenance items for domestic and imported cars, vans, sport utility vehicles, and light and heavy duty trucks. The company offers battery accessories; belts and ", "industry": "Specialty Retail", "marketCap": 849000000000, "sector": "Consumer Cyclical"}, "AAPL": {"avgVolume": 86434942, "description": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. It also sells various related services. In addition, the company offers iPhone, a line of smartphones; Mac, a line of personal co", "industry": "Consumer Electronics", "marketCap": 2098000000000000, "sector": "Technology"}, "AAQC": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "AAT": {"avgVolume": 340868, "description": "American Assets Trust, Inc. is a full service, vertically integrated and self-administered real estate investment trust, or REIT, headquartered in San Diego, California. The company has over 50 years of experience in acquiring, improving, developing and m", "industry": "REIT-Diversified", "marketCap": 2035000000000, "sector": "Real Estate"}, "AATC": {"avgVolume": 18928, "description": "Autoscope Technologies Corporation develops and markets video and radar processing products for use in intersection control, highway, bridge and tunnel traffic management, and traffic data collection applications in the Asia Pacific, Europe, the Middle Ea", "industry": "Scientific & Technical Instruments", "marketCap": 20549000000, "sector": "Technology"}, "AAU": {"avgVolume": 338846, "description": "Almaden Minerals Ltd., an exploration stage company, engages in the acquisition, exploration, evaluation, and development of mineral properties. It primarily owns a 100% interest in the Ixtaca gold-silver project located in Puebla State, Mexico. The compa", "industry": "Gold", "marketCap": 34195000000, "sector": "Basic Materials"}, "AAWW": {"avgVolume": 479258, "description": "Atlas Air Worldwide Holdings, Inc., through its subsidiaries, provides outsourced aircraft and aviation operating services. It operates through two segments, Airline Operations and Dry Leasing. The company offers outsourced cargo and passenger aircraft op", "industry": "Airports & Air Services", "marketCap": 2856000000000, "sector": "Industrials"}, "AB": {"avgVolume": 371704, "description": "AllianceBernstein Holding L.P. is publicly owned investment manager. The firm also provides research services to its clients. It provides its services to investment companies, pension and profit sharing plans, banks and thrift institutions, trusts, estate", "industry": "Asset Management", "marketCap": 3422000000000, "sector": "Financial Services"}, "ABB": {"avgVolume": 1586743, "description": "ABB Ltd engages in manufacture and sale of electrification, automation, robotics, and motion products for customers in utilities, industry and transport, and infrastructure in Switzerland and internationally. Its Electrification segment provides electric ", "industry": "Electrical Equipment & Parts", "marketCap": 57186000000000, "sector": "Industrials"}, "ABBV": {"avgVolume": 5557837, "description": "AbbVie Inc. discovers, develops, manufactures, and sells pharmaceuticals in the worldwide. The company offers HUMIRA, a therapy administered as an injection for autoimmune and intestinal Behçet's diseases; SKYRIZI to treat moderate to severe plaque psoria", "industry": "Drug Manufacturers-General", "marketCap": 288245000000000, "sector": "Healthcare"}, "ABC": {"avgVolume": 1517670, "description": "AmerisourceBergen Corporation sources and distributes pharmaceutical products. Its U.S. Healthcare Solutions segment distributes brand-name and generic pharmaceuticals, over-the-counter healthcare products, home healthcare supplies and equipment, and rela", "industry": "Medical Distribution", "marketCap": 34151000000000, "sector": "Healthcare"}, "ABCB": {"avgVolume": 349822, "description": "Ameris Bancorp operates as the bank holding company for Ameris Bank that provides range of banking services to retail and commercial customers primarily in Georgia, Alabama, Florida, North Carolina, and South Carolina. The company operates through five se", "industry": "Banks-Regional", "marketCap": 3326000000000, "sector": "Financial Services"}, "ABCL": {"avgVolume": 2022437, "description": "AbCellera Biologics Inc. develops antibody discovery platform. Its full-stack, artificial intelligence-powered antibody discovery platform searches and analyzes the database of natural immune systems to find antibodies that could be developed as drugs. As", "industry": "Biotechnology", "marketCap": 2712000000000, "sector": "Healthcare"}, "ABCM": {"avgVolume": 525222, "description": "Abcam plc, a life science company, focuses on identifying, developing, and distributing reagents and tools for scientific research, diagnostics, and drug discovery. Its principal products include primary and secondary antibodies; conjugated antibodies and", "industry": "Biotechnology", "marketCap": 362000000000, "sector": "Healthcare"}, "ABEO": {"avgVolume": 544638, "description": "Abeona Therapeutics Inc., a clinical-stage biopharmaceutical company, develops gene and cell therapies for life-threatening rare genetic diseases. Its lead program is EB-101, an autologous, gene-corrected cell therapy that is in Phase III clinical trial f", "industry": "Biotechnology", "marketCap": 41394000000, "sector": "Healthcare"}, "ABEV": {"avgVolume": 29975433, "description": "Ambev S.A., through its subsidiaries, produces, distributes, and sells beer, draft beer, carbonated soft drinks, other non-alcoholic beverages, malt, and food products. The company operates through four segments: Brazil; Central America and the Caribbean;", "industry": "Beverages-Brewers", "marketCap": 43101000000000, "sector": "Consumer Defensive"}, "ABG": {"avgVolume": 200575, "description": "Asbury Automotive Group, Inc., together with its subsidiaries, operates as an automotive retailer in the United States. It offers a range of automotive products and services, including new and used vehicles; and vehicle repair and maintenance services, re", "industry": "Auto & Truck Dealerships", "marketCap": 3818000000000, "sector": "Consumer Cyclical"}, "ABGI": {"avgVolume": 45125, "description": "ABG Acquisition Corp. I does not have significant operations. It focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. ABG Acquisition Corp. I was inc", "industry": "Shell Companies", "marketCap": 194679000000, "sector": "Financial Services"}, "ABIO": {"avgVolume": 28235, "description": "ARCA biopharma, Inc., a clinical-stage biopharmaceutical company, develops and commercializes genetically targeted therapies for cardiovascular diseases. Its lead product candidates are Recombinant Nematode Anticoagulant Protein c2 (rNAPc2) (AB201), which", "industry": "Biotechnology", "marketCap": 32999000000, "sector": "Healthcare"}, "ABM": {"avgVolume": 322066, "description": "ABM Industries Incorporated, through its subsidiaries, engages in the provision of integrated facility, infrastructure, and mobility solutions in the United States and internationally. The company operates through Business & Industry, Manufacturing & Dist", "industry": "Specialty Business Services", "marketCap": 2925000000000, "sector": "Industrials"}, "ABMD": {"avgVolume": 1482732, "description": "Abiomed, Inc. engages in the research, development, and sale of medical devices to assist or replace the pumping function of the failing heart. It also provides a continuum of care to heart failure patients. The company offers Impella 2.5, a percutaneous ", "industry": "Medical Devices", "marketCap": 17181000000000, "sector": "Healthcare"}, "ABNB": {"avgVolume": 6138025, "description": "Airbnb, Inc., together with its subsidiaries, operates a platform that enables hosts to offer stays and experiences to guests worldwide. The company's marketplace model connects hosts and guests online or through mobile devices to book spaces and experien", "industry": "Travel Services", "marketCap": 52864000000000, "sector": "Consumer Cyclical"}, "ABOS": {"avgVolume": 1451609, "description": "Acumen Pharmaceuticals, Inc., a clinical-stage biopharmaceutical company, discovers and develops therapies for the treatment of Alzheimer's disease. The company focuses on advancing a targeted immunotherapy drug candidate ACU193, a humanized monoclonal an", "industry": "Biotechnology", "marketCap": 207491000000, "sector": "Healthcare"}, "ABP": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "ABR": {"avgVolume": 2101525, "description": "Arbor Realty Trust, Inc. invests in a diversified portfolio of structured finance assets in the multifamily, single-family rental, and commercial real estate markets in the United States. The company operates in two segments, Structured Business and Agenc", "industry": "REIT-Mortgage", "marketCap": 2331000000000, "sector": "Real Estate"}, "ABSI": {"avgVolume": 309424, "description": "Absci Corporation, a drug and target discovery company, provides biologic drug candidates and production cell lines using integrated drug creation platform for partners in the United States. Its integrated drug creation platform enables the creation of bi", "industry": "Biotechnology", "marketCap": 18479000000, "sector": "Healthcare"}, "ABST": {"avgVolume": 113046, "description": "Absolute Software Corporation develops, markets, and provides software services that support the management and security of computing devices, applications, data, and networks for various organizations. The company's Absolute platform offer Absolute Visib", "industry": "Software-Application", "marketCap": 505224000000, "sector": "Technology"}, "ABT": {"avgVolume": 5839506, "description": "Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Dev", "industry": "Medical Devices", "marketCap": 189299000000000, "sector": "Healthcare"}, "ABUS": {"avgVolume": 949516, "description": "Arbutus Biopharma Corporation, a biopharmaceutical company, develops novel therapeutics for chronic Hepatitis B virus (HBV) infection, SARS-CoV-2, and other coronaviruses in the United States. Its HBV product pipeline consists of AB-729, a proprietary sub", "industry": "Biotechnology", "marketCap": 364568000000, "sector": "Healthcare"}, "ABVC": {"avgVolume": 16425, "description": "ABVC BioPharma, Inc., a clinical stage biopharmaceutical company, develops drugs and medical devices to fulfill unmet medical needs in the United States. The company is developing ABV-1501, which is in Phase I/II clinical trials a combination therapy for ", "industry": "Biotechnology", "marketCap": 21211000000, "sector": "Healthcare"}, "AC": {"avgVolume": 3496, "description": "Associated Capital Group, Inc. provides investment advisory services in the United States. The company offers alternative investment management and asset management services. It also invests in new and existing businesses. The company was founded in 1976 ", "industry": "Capital Markets", "marketCap": 891529000000, "sector": "Financial Services"}, "ACA": {"avgVolume": 229337, "description": "Arcosa, Inc., together with its subsidiaries, provides infrastructure-related products and solutions for the construction, energy, and transportation markets in North America. It operates through three segments: Construction Products, Engineered Structure", "industry": "Infrastructure Operations", "marketCap": 2678000000000, "sector": "Industrials"}, "ACAB": {"avgVolume": 19391, "description": "Atlantic Coastal Acquisition Corp. II does not have significant operations. It focuses on effecting a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization, or similar business combination with one or more businesses ", "industry": "Shell Companies", "marketCap": 38175000000, "sector": "Financial Services"}, "ACAD": {"avgVolume": 1311469, "description": "ACADIA Pharmaceuticals Inc., a biopharmaceutical company, focuses on the development and commercialization of small molecule drugs that address unmet medical needs in central nervous system disorders. The company offers NUPLAZID (pimavanserin) for the tre", "industry": "Biotechnology", "marketCap": 2478000000000, "sector": "Healthcare"}, "ACAH": {"avgVolume": 51916, "description": "Atlantic Coastal Acquisition Corp. does not have significant operations. It intends to effect a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses in mobility sect", "industry": "Shell Companies", "marketCap": 431681000000, "sector": "Financial Services"}, "ACAQ": {"avgVolume": 70904, "description": "Athena Consumer Acquisition Corp. does not have significant operations. It focuses on effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or related business combination with one or more businesses. The company i", "industry": "Shell Companies", "marketCap": 336352000000, "sector": "Financial Services"}, "ACAX": {"avgVolume": 4941, "description": "Alset Capital Acquisition Corp. focuses on effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses. It intends to focus on identifying businesses in the rea", "industry": "Shell Companies", "marketCap": 112775000000, "sector": "Financial Services"}, "ACB": {"avgVolume": 13158985, "description": "Aurora Cannabis Inc., together with its subsidiaries, produces, distributes, and sells cannabis and cannabis-derivative products in Canada and internationally. The company produces, distributes, and sells medical and consumer cannabis products in Canada. ", "industry": "Drug Manufacturers-Specialty & Generic", "marketCap": 279413000000, "sector": "Healthcare"}, "ACBA": {"avgVolume": 8204, "description": "Ace Global Business Acquisition Limited does not have significant operations. The company intends to effect a merger, share exchange, asset acquisition, share purchase, recapitalization, reorganization, or similar business combination with one or more bus", "industry": "Shell Companies", "marketCap": 64475000000, "sector": "Financial Services"}, "ACBI": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "ACCD": {"avgVolume": 651188, "description": "Accolade, Inc., together with its subsidiaries, develops and provides technology-enabled solutions that help people to understand, navigate, and utilize the healthcare system and their workplace benefits in the United States. The company offers a platform", "industry": "Health Information Services", "marketCap": 517241000000, "sector": "Healthcare"}, "ACCO": {"avgVolume": 746932, "description": "ACCO Brands Corporation designs, manufactures, and markets consumer, school, technology, and office products. It operates through three segments: ACCO Brands North America, ACCO Brands EMEA, and ACCO Brands International. The company provides computer and", "industry": "Business Equipment & Supplies", "marketCap": 529746000000, "sector": "Industrials"}, "ACDC": {"avgVolume": 404580, "description": "ProFrac Holding Corp., a vertically integrated and energy services company, provides hydraulic fracturing, completion, and other products and services to upstream oil and gas companies engaged in the exploration and production of North American unconventi", "industry": "Oil & Gas Equipment & Services", "marketCap": 135000000000, "sector": "Energy"}, "ACDI": {"avgVolume": 36911, "description": "Ascendant Digital Acquisition Corp. III does not have significant operations. It intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses in the interactive ", "industry": "Shell Companies", "marketCap": 38625000000, "sector": "Financial Services"}, "ACEL": {"avgVolume": 246152, "description": "Accel Entertainment, Inc., together with its subsidiaries, operates as a distributed gaming operator in the United States. It is involved in the installation, maintenance, and operation of gaming terminals; redemption devices that disburse winnings and co", "industry": "Gambling", "marketCap": 658627000000, "sector": "Consumer Cyclical"}, "ACER": {"avgVolume": 378986, "description": "Acer Therapeutics Inc., a pharmaceutical company, focuses on the acquisition, development, and commercialization of therapies for serious rare and life-threatening diseases. Its pipeline includes four clinical-stage candidates comprising EDSIVO for the tr", "industry": "Biotechnology", "marketCap": 4839000000, "sector": "Healthcare"}, "ACET": {"avgVolume": 745772, "description": "Adicet Bio, Inc., a biotechnology company, discovers and develops allogeneic gamma delta T cell therapies for cancer and other diseases. The company offers gamma delta T cells engineered with chimeric antigen receptors and T cell receptor-like antibodies ", "industry": "Biotechnology", "marketCap": 330812000000, "sector": "Healthcare"}, "ACEV": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "ACGL": {"avgVolume": 4036865, "description": "Arch Capital Group Ltd., together with its subsidiaries, provides insurance, reinsurance, and mortgage insurance products worldwide. The company's Insurance segment offers primary and excess casualty coverages; loss sensitive primary casualty insurance pr", "industry": "Insurance-Diversified", "marketCap": 23531000000000, "sector": "Financial Services"}, "ACHC": {"avgVolume": 649586, "description": "Acadia Healthcare Company, Inc. provides behavioral healthcare services in the United States and Puerto Rico. The company offers behavioral healthcare services to its patients in various settings, including inpatient psychiatric hospitals, specialty treat", "industry": "Medical Care Facilities", "marketCap": 7513000000000, "sector": "Healthcare"}, "ACHL": {"avgVolume": 160316, "description": "Achilles Therapeutics Plc, a clinical stage immuno-oncology biopharmaceutical company, develops precision T cell therapies to treat various solid tumors. The company's lead product candidates include CHIRON, which is in Phase I/IIa clinical trial for use ", "industry": "Biotechnology", "marketCap": 32751000000, "sector": "Healthcare"}, "ACHR": {"avgVolume": 1312047, "description": "Archer Aviation Inc., an urban air mobility company, engages in designs, develops, manufactures, and operates electric vertical takeoff and landing aircrafts to carry passengers. The company was formerly known as Atlas Crest Investment Corp. and changed i", "industry": "Aerospace & Defense", "marketCap": 396571000000, "sector": "Industrials"}, "ACHV": {"avgVolume": 66519, "description": "Achieve Life Sciences, Inc., a clinical-stage pharmaceutical company, develops and commercializes of cytisinicline for smoking cessation and nicotine addiction in Canada, the United States, and the United Kingdom. The company offers cytisinicline, a plant", "industry": "Biotechnology", "marketCap": 43311000000, "sector": "Healthcare"}, "ACI": {"avgVolume": 5070859, "description": "Albertsons Companies, Inc., through its subsidiaries, engages in the operation of food and drug stores in the United States. The company's food and drug retail stores offer grocery products, general merchandise, health and beauty care products, pharmacy, ", "industry": "Grocery Stores", "marketCap": 11295000000000, "sector": "Consumer Defensive"}, "ACII": {"avgVolume": -1, "description": "", "industry": "", "marketCap": -1, "sector": ""}, "ACIU": {"avgVolume": 123970, "description": "AC Immune SA, a clinical stage biopharmaceutical company, discovers, designs, and develops medicines and diagnostic products for the prevention and treatment of neurodegenerative diseases associated with protein misfolding. Its SupraAntigen and Morphomer ", "industry": "Biotechnology", "marketCap": 14514000000, "sector": "Healthcare"}, "ACIW": {"avgVolume": 976380, "description": "ACI Worldwide, Inc., a software company, develops, markets, installs, and supports a range of software products and solutions for facilitating digital payments to banks, merchants, and billers worldwide. The company offers ACI Acquiring, a merchant manage", "industry": "Software-Infrastructure", "marketCap": 2501000000000, "sector": "Technology"}, "ACLS": {"avgVolume": 397203, "description": "Axcelis Technologies, Inc. designs, manufactures, and services ion implantation and other processing equipment used in the fabrication of semiconductor chips in the United States, Europe, and Asia. The company offers high energy, high current, and medium ", "industry": "Semiconductor Equipment & Materials", "marketCap": 2602000000000, "sector": "Technology"}, "ACLX": {"avgVolume": 608760, "description": "Arcellx, Inc., a clinical-stage biotechnology company, engages in the development of various immunotherapies for patients with cancer and other incurable diseases. The company's lead ddCAR product candidate is CART-ddBCMA, which is in phase 1 clinical tri", "industry": "Biotechnology", "marketCap": 1299000000000, "sector": "Healthcare"}, "ACM": {"avgVolume": 698573, "description": "AECOM, together with its subsidiaries, provides professional infrastructure consulting services worldwide. It operates in three segments: Americas, International, and AECOM Capital. The company offers planning, consulting, architectural and engineering de", "industry": "Engineering & Construction", "marketCap": 11874000000000, "sector": "Industrials"}, "ACMR": {"avgVolume": 1026831, "description": "ACM Research, Inc., together with its subsidiaries, develops, manufactures, and sells single-wafer wet cleaning equipment for enhancing the manufacturing process and yield for integrated chips worldwide. It offers space alternated phase shift technology f", "industry": "Semiconductor Equipment & Materials", "marketCap": 428114000000, "sector": "Technology"}, "ACN": {"avgVolume": 2242963, "description": "Accenture plc, a professional services company, provides strategy and consulting, interactive, industry X, song, and technology and operation services worldwide. The company offers application services, including agile transformation, DevOps, application ", "industry": "Information Technology Services", "marketCap": 167211000000000, "sector": "Technology"}, "ACNB": {"avgVolume": 13583, "description": "ACNB Corporation, a financial holding company, provides banking, insurance, and financial services to individual, business, and government customers in the United States. The company offers checking, savings, and money market deposit accounts, as well as ", "industry": "Banks-Regional", "marketCap": 343481000000, "sector": "Financial Services"}, "ACNT": {"avgVolume": 25367, "description": "Ascent Industries Co. an industrials company, focuses on the production and distribution of industrial tubular products and specialty chemicals in the United States and internationally. It manufactures welded pipes and tubes, primarily from stainless stee", "industry": "Steel", "marketCap": 86515000000, "sector": "Basic Materials"}, "ACON": {"avgVolume": 45747, "description": "Aclarion, Inc., a healthcare technology company, develops software application for magnetic resonance spectroscopy (MRS) in the United States. It offers NOCISCAN-LS Post-Processor suite comprising NOCICALC-LS that receives and processes the acquired disc ", "industry": "Health Information Services", "marketCap": 3051000000, "sector": "Healthcare"}, "ACOR": {"avgVolume": 4031627, "description": "Acorda Therapeutics, Inc., a biopharmaceutical company, develops and commercializes therapies for neurological disorders in the United States. The company markets Ampyra (dalfampridine), an oral drug to improve walking in patients with multiple sclerosis ", "industry": "Drug Manufacturers-Specialty & Generic", "marketCap": 1508000000, "sector": "Healthcare"}, "ACQR": {"avgVolume": 157126, "description": "Independence Holdings Corp. does not have significant operations. It intends to effect a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or related business combination with one or more businesses or entities. The compan", "industry": "Shell Companies", "marketCap": 624225000000, "sector": "Financial Services"}}